-- phpMyAdmin SQL Dump
-- version 5.0.3
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2020-11-17 04:39:11
-- 伺服器版本： 10.4.14-MariaDB
-- PHP 版本： 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `class1`
--

-- --------------------------------------------------------

--
-- 資料表結構 `class`
--

CREATE TABLE `class` (
  `class_id` int(50) UNSIGNED NOT NULL,
  `class_name` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `class_teacher` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `class_type` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `class_content` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `class_open_num` int(5) NOT NULL,
  `class_price` int(10) NOT NULL,
  `class_week` varchar(10) CHARACTER SET utf8mb4 NOT NULL,
  `class_time_s` time NOT NULL,
  `class_time_e` time NOT NULL,
  `class_times` int(10) NOT NULL,
  `class_place` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `class_item` varchar(30) COLLATE utf8mb4_unicode_ci NOT NULL,
  `class_deadline_date` date NOT NULL,
  `class_start_date` date NOT NULL,
  `class_end_date` date NOT NULL,
  `class_add_date` datetime NOT NULL,
  `class_change_date` datetime NOT NULL,
  `class_valid` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `class`
--

INSERT INTO `class` (`class_id`, `class_name`, `class_teacher`, `class_type`, `class_content`, `class_open_num`, `class_price`, `class_week`, `class_time_s`, `class_time_e`, `class_times`, `class_place`, `class_item`, `class_deadline_date`, `class_start_date`, `class_end_date`, `class_add_date`, `class_change_date`, `class_valid`) VALUES
(1, '晨昏風景班', '克萊德', '風景', '常出國拍大山大水的您或走過許多美麗景色的場景，覺得無法記錄下當下的美？老師會教您各種技巧拍好風景之美～想快速的學會拍出好作品？小班制、學習效果最好！短時間迅速學會攝影～', 20, 2000, '每周一', '12:00:00', '13:00:00', 4, '象山六巨石', '類單眼相機', '2020-11-08', '2020-11-15', '2020-12-15', '2020-11-06 00:00:00', '2020-11-07 00:00:00', 1),
(2, '人像攝影班', '溫生蠔', '人像', '從最基本的三要素（光圈、快門、ISO）的基本觀念開始帶領你學習拍攝人像攝影及用光技巧，進而拍出一張標準的（清新明亮原色調）人像作品。 不必擔心相機是不是單眼相機、鏡頭貴不貴或是年紀會不會太大！', 15, 1500, '每周四', '13:00:00', '14:00:00', 4, 'Ciao studio', '數位相機', '2020-11-12', '2020-11-19', '2020-12-19', '2020-11-10 00:00:00', '2020-11-11 00:00:00', 1),
(3, '影像編修班', '克萊德', '影像編輯', '本課程主要教學：學習攝影後製編修，以簡單易學的方式讓您了解數位影像後製的秘密，學習後製的技巧重現拍照時的真實感動，實現心中的想像，相片風格化讓影像更特別並可挽救拍壞的相片！', 20, 2000, '每周二', '14:00:00', '15:00:00', 4, '華山藝文特區教室A', '數位相機', '2020-12-01', '2020-12-08', '2021-01-08', '2020-11-27 00:00:00', '2020-11-30 00:00:00', 1),
(4, '手機攝影班', '楊紹凡', '風景', '精緻班，一班只收15位以內，迅速讓您掌握構圖，即使使用手機一樣能拍出動人的畫面', 10, 1000, '每周三', '15:00:00', '16:00:00', 5, '美麗華摩天輪', '手機', '2020-11-27', '2020-12-04', '2021-01-11', '2020-11-09 00:00:00', '2020-11-26 00:00:00', 1),
(5, '攝影基礎班', '王曉明', '風景', '我們會從零開始，指導您學會使用相機每個功能，使您將相機功能發揮到最大效能，進而拍出一張動人又有深度的作品！', 10, 2000, '每周一', '16:00:00', '17:00:00', 3, '淡水漁人碼頭', '手機,數位相機', '2020-12-25', '2021-01-01', '2021-01-25', '2020-12-10 00:00:00', '2020-12-24 00:00:00', 1),
(6, '攝影進階班', '陳大名', '風景', '課程包括3堂教室課、3堂外拍課，兼具理論與實務。課堂課會重點式介紹相機操作設定技巧，以及常見題材的拍攝要訣。外拍各以街拍、風景、夜景為主題，強調實戰經驗。', 10, 3000, '每周四', '17:00:00', '18:00:00', 3, '九份', '類單眼相機,單眼相機', '2020-12-27', '2021-01-03', '2021-01-27', '2020-12-17 00:00:00', '2020-12-26 00:00:00', 1),
(7, '閃光燈班', '王曉明', '人像', '本課程針對人像攝影閃燈要如何架設和操作，由單燈到雙燈至多燈，如何設定光的方向與光比，如何運用柔光傘改變光質，經由實際的操作練習學習人像閃燈的運用。 ', 10, 2000, '每周三', '18:00:00', '19:00:00', 3, 'R-room 攝影棚', '數位相機', '2021-01-20', '2021-01-27', '2021-02-20', '2021-01-12 00:00:00', '2021-01-19 00:00:00', 1),
(8, '縫卡黑卡專修班', '陳大名', '風景', '拍日出夕陽和風景最怕反差太大，往往不是天空死白就是地面死黑，使用搖黑卡或縫卡技巧，當下就能改善過曝或過暗情形使作品恢復細節～拍日出或者拍夕陽更是要學。想體驗如此奧妙的感覺嗎？快來報名吧！', 15, 4000, '每周一', '19:00:00', '20:00:00', 5, '阿里山', '腳架,單眼相機', '2020-12-16', '2020-12-23', '2021-01-30', '2020-12-03 00:00:00', '2020-12-15 00:00:00', 1),
(9, '商品攝影實戰班', '克萊德', '物品', '本課程為商業攝影實務，介紹三種主要造型之商品(圓柱或立方體、透明體、扁型商品)架棚方式與打光方式，只要您學起來，起碼能夠應付約70%的商品單品拍攝與簡單情境。', 15, 3500, '每周二', '20:00:00', '21:00:00', 4, '拍廊', '單眼相機', '2020-12-17', '2020-12-24', '2021-01-24', '2020-12-07 00:00:00', '2020-12-16 00:00:00', 1),
(10, '職人商品攝影必學課', '楊紹凡', '物品', '本課程將不同種類的商品分為 10 個單元，在實作前，讓大家了解拍攝前應該如何構思畫面，拍攝的重點是什麼，先抓住拍攝重點，以便在後續實作過程中，明白操作的原因，幫助大家更快理解並記住各種拍攝技巧', 20, 3500, '每周二', '21:00:00', '22:00:00', 6, '華山藝文特區教室C', '類單眼相機', '2020-12-25', '2021-01-01', '2021-02-15', '2020-12-21 00:00:00', '2020-12-24 00:00:00', 1),
(11, '水中攝影班', '林曼易', '風景', '水底攝影是最受歡迎的潛水專長之一，而數碼水底攝影的興起，讓水底攝影變得更簡單也更有趣。', 10, 3500, '每周一', '22:00:00', '23:00:00', 2, '小琉球', '單眼相機,底片相機', '2020-12-15', '2020-12-20', '2021-01-03', '2020-12-08 00:00:00', '2020-12-10 00:00:00', 1),
(12, '生態攝影班', '林曼易', '風景', '生態攝影是只要一片青草綠地就能和你開啟的心靈對話，簡樸單純，從觀察而學習，看著小生命的不同脈動，你將會體驗更多的自然視界。', 14, 2500, '每周一', '23:00:00', '00:00:00', 4, '田寮月世界', '單眼相機,數位相機', '2020-12-19', '2020-12-25', '2021-01-25', '2020-12-15 00:00:00', '2020-12-16 00:00:00', 1),
(13, '單眼相機基礎班', '溫生蠔', '風景', '上了基礎班將使您快速的學會拍好一手好作品，也讓您迅速打好攝影基礎～', 20, 3000, '每周三', '00:00:00', '01:00:00', 3, '光之穹頂', '單眼相機', '2020-11-29', '2020-11-30', '2020-12-23', '2020-11-20 00:00:00', '2020-11-25 00:00:00', 1),
(14, '單眼相機進階班', '溫生蠔', '風景', '本進階班課程主要傳授攝影學中，最重要的構圖、機會快門及攝影眼的培養。', 14, 2000, '每周四', '01:00:00', '02:00:00', 3, '美濃杉林花海', '單眼相機', '0000-00-00', '2020-12-01', '2020-12-21', '2020-11-29 00:00:00', '2020-11-30 00:00:00', 1),
(15, '相機錄影課程', '楊紹凡', '影像編輯', '本課程ＣＰ值超高！不到兩個小時讓你完全搞懂數位錄影', 15, 2000, '每周五', '02:00:00', '03:00:00', 2, '華山藝文特區教室A', '數位相機', '2020-12-31', '2021-01-03', '2021-01-17', '2020-12-28 00:00:00', '2020-12-31 00:00:00', 1),
(16, '數位攝影班', '陳大名', '物品', '學生將能熟悉相機結構與原理、操作與保養相機、比較傳 統與數位相機、熟悉相曝光模式與測光模式、熟練採光技巧、 具備構圖概念', 16, 2400, '每周日', '03:00:00', '04:00:00', 3, '華山藝文特區教室A', '數位相機,單眼相機', '2021-01-10', '2021-01-15', '2021-02-05', '2020-01-03 00:00:00', '2021-01-05 00:00:00', 1),
(17, '手機夜景拍攝班', '吳佳穎', '風景', '「手機相機攝影」也是最近很多人想學的觀念，雖然攝影原理通了，任何攝影器材也能觸類旁通，本課程帶你以「手機相機」的角度，來練習如何操作手機正確的夜拍。', 20, 1500, '每周六', '04:00:00', '05:00:00', 4, '鰲峰山觀景平台', '手機', '2021-01-19', '2021-01-20', '2021-02-20', '2021-01-12 00:00:00', '2021-01-15 00:00:00', 1),
(18, '手機商品班', '吳佳穎', '物品', '手機拍照已經是許多人生活中不可或缺的習慣，不論是把自己拍的美美或是出外旅行拍照打卡，手機拍照已經變成一種全民運動', 10, 4000, '每周一', '05:00:00', '06:00:00', 4, 'Anmagarden艾瑪花園', '手機', '2020-12-20', '2020-12-25', '2021-01-25', '2020-12-13 00:00:00', '2020-12-18 00:00:00', 1),
(19, '室內人像班', '陳大名', '人像', '本課程包括2堂教室課，2堂外拍課，兼具觀念與技巧，理論與實務並用', 16, 2500, '每周日', '06:00:00', '07:00:00', 4, 'KEIZU Studio凱茲攝影部', '單眼相機,數位相機', '2021-02-15', '2021-02-20', '2021-03-20', '2020-02-07 00:00:00', '2021-02-09 00:00:00', 1),
(20, '現代風景攝影班', '王曉明', '風景', '現代風景攝影在國外已經盛行多年，為國際風景攝影界主流，然而國內目前仍少有人知。', 21, 4000, '每周日', '07:00:00', '08:00:00', 2, '石岡落羽松', '單眼相機,底片相機', '2021-01-30', '2021-01-31', '2021-02-14', '2020-01-21 00:00:00', '2021-01-28 00:00:00', 1),
(21, '初階商業人像攝影課程', '楊紹凡', '人像', '初階攝影課程從基礎開始，直接從實務操作學習商業人像攝影。', 16, 3680, '每周日', '08:00:00', '09:00:00', 3, '三創生活園區(5樓)', '單眼相機', '2020-12-04', '2020-12-13', '2020-12-27', '2020-11-06 00:00:00', '2020-11-07 00:00:00', 1),
(22, '初階商業商品攝影課程', '楊紹凡', '商品', '初階攝影課程從基礎開始，直接從實務操作學習商業商品攝影。', 16, 5500, '每周六', '09:00:00', '10:00:00', 4, '三創生活園區(5樓)', '單眼相機', '2020-12-04', '2020-12-12', '2020-12-26', '2020-11-01 00:00:00', '2020-11-05 00:00:00', 1),
(23, '用手機．拍片去！手機輕旅行的影片日記', '王子瑋', 'vlog', '這堂課將用系統且完整的方式，深入淺出地分享旅行錄影的技巧，只要善用自己的手機，就能用影片記錄下自己的旅行日記。', 8, 3500, '每周一', '10:00:00', '11:00:00', 5, '中原大學', '手機', '2020-10-02', '2020-10-04', '2020-11-01', '2020-09-09 00:00:00', '2020-09-10 00:00:00', 1),
(24, '時尚攝影進階班', '黃天仁', '人像', '時尚攝影大師黃天仁 教您拍出美女時尚照，靈感源自生活，質感始於嚐試', 20, 4500, '每周日', '11:00:00', '12:00:00', 2, '華山藝文特區教室A', '單眼相機', '2020-10-16', '2020-10-25', '2020-11-01', '2020-10-07 00:00:00', '2020-10-08 00:00:00', 1),
(25, '時尚攝影高階班', '黃天仁', '人像', '時尚攝影大師黃天仁 教您拍出美女時尚照，靈感源自生活，質感始於嚐試', 10, 5500, '每周六', '12:00:00', '13:00:00', 3, '華山藝文特區教室A', '單眼相機', '2020-12-12', '2020-12-26', '2021-01-09', '2020-11-01 00:00:00', '2020-11-05 00:00:00', 1),
(26, '時尚攝影入門班', '黃天仁', '人像', '時尚攝影大師黃天仁 教您拍出美女時尚照，靈感源自生活，質感始於嚐試', 15, 3500, '每周五', '13:00:00', '14:00:00', 2, '華山藝文特區教室A', '單眼相機', '2020-10-20', '2020-11-06', '2020-11-13', '2020-08-13 00:00:00', '2020-08-15 00:00:00', 1),
(27, '手機輕旅行的影片日記進階班', '王子瑋', 'vlog', '這堂課將用系統且完整的方式，深入淺出地分享旅行錄影的技巧，只要善用自己的手機，就能用影片記錄下自己的旅行日記。', 8, 3500, '每周一', '14:00:00', '15:00:00', 5, '中原大學', '手機', '2020-11-14', '2020-11-15', '2020-12-13', '2020-10-09 00:00:00', '2020-10-10 00:00:00', 1),
(28, '空拍專題攝影班1', '葉世賢', '空拍', '東澳粉鳥林空拍拍照與錄影實作', 8, 800, '每周日', '15:00:00', '16:00:00', 1, '東澳粉鳥林', '空拍機', '2020-11-12', '2020-11-22', '2020-11-22', '2020-10-01 00:00:00', '2020-10-02 00:00:00', 1),
(29, '空拍專題攝影班2', '葉世賢', '空拍', '十三層博物館空拍拍照與錄影實作', 8, 800, '每周日', '16:00:00', '17:00:00', 1, '十三層博物館', '空拍機', '2020-11-20', '2020-11-27', '2020-11-27', '2020-10-04 00:00:00', '2020-10-06 00:00:00', 1),
(30, '空拍專題攝影班3', '葉世賢', '空拍', '龜山島空拍拍照與錄影實作', 8, 800, '每周日', '17:00:00', '18:00:00', 1, '龜山島', '空拍機', '2020-11-27', '2020-12-04', '2020-12-04', '2020-09-10 00:00:00', '2020-09-12 00:00:00', 1),
(31, '晨昏風景班2', '克萊德', '風景', '常出國拍大山大水的您或走過許多美麗景色的場景，覺得無法記錄下當下的美？老師會教您各種技巧拍好風景之美～想快速的學會拍出好作品？小班制、學習效果最好！短時間迅速學會攝影～', 20, 2000, '每周一', '16:00:00', '19:00:00', 4, '三仙台', '類單眼相機', '2020-12-08', '2020-12-12', '2021-01-12', '2020-11-07 00:00:00', '2020-11-09 00:00:00', 1),
(32, '人像攝影班2', '溫生蠔', '人像', '從最基本的三要素（光圈、快門、ISO）的基本觀念開始帶領你學習拍攝人像攝影及用光技巧，進而拍出一張標準的（清新明亮原色調）人像作品。 不必擔心相機是不是單眼相機、鏡頭貴不貴或是年紀會不會太大！', 15, 1500, '每周四', '19:00:00', '21:00:00', 4, 'Ciao studio', '數位相機', '2020-12-12', '2020-12-15', '2021-01-15', '2020-11-11 00:00:00', '2020-11-18 00:00:00', 1),
(33, '影像編修班2', '克萊德', '影像編輯', '本課程主要教學：學習攝影後製編修，以簡單易學的方式讓您了解數位影像後製的秘密，學習後製的技巧重現拍照時的真實感動，實現心中的想像，相片風格化讓影像更特別並可挽救拍壞的相片！', 20, 2000, '每周二', '09:00:00', '12:00:00', 4, '華山藝文特區教室A', '數位相機', '2021-01-01', '2021-01-04', '2021-02-04', '2020-11-28 00:00:00', '2020-12-02 00:00:00', 1),
(34, '手機攝影班2', '楊紹凡', '風景', '精緻班，一班只收15位以內，迅速讓您掌握構圖，即使使用手機一樣能拍出動人的畫面', 10, 1000, '每周三', '19:00:00', '21:00:00', 5, '奇美博物館', '手機', '2021-01-27', '2021-01-31', '2021-02-11', '2020-11-10 00:00:00', '2020-11-28 00:00:00', 1),
(35, '攝影基礎班2', '王曉明', '風景', '我們會從零開始，指導您學會使用相機每個功能，使您將相機功能發揮到最大效能，進而拍出一張動人又有深度的作品！', 10, 2000, '每周一', '22:00:00', '23:00:00', 3, '合歡山', '手機,數位相機', '2021-01-25', '2021-01-28', '2021-02-21', '2020-12-14 00:00:00', '2020-12-28 00:00:00', 1),
(36, '攝影進階班2', '陳大名', '風景', '課程包括3堂教室課、3堂外拍課，兼具理論與實務。課堂課會重點式介紹相機操作設定技巧，以及常見題材的拍攝要訣。外拍各以街拍、風景、夜景為主題，強調實戰經驗。', 10, 3000, '每周四', '14:00:00', '15:00:00', 3, '東清灣', '類單眼相機,單眼相機', '2021-01-27', '2021-02-02', '2021-02-24', '2020-12-21 00:00:00', '2020-12-29 00:00:00', 1),
(37, '閃光燈班2', '王曉明', '人像', '本課程針對人像攝影閃燈要如何架設和操作，由單燈到雙燈至多燈，如何設定光的方向與光比，如何運用柔光傘改變光質，經由實際的操作練習學習人像閃燈的運用。 ', 10, 2000, '每周三', '14:00:00', '03:00:00', 3, 'R-room 攝影棚', '數位相機', '2021-02-20', '2021-03-01', '2021-03-25', '2021-01-14 00:00:00', '2021-01-28 00:00:00', 1),
(38, '縫卡黑卡專修班2', '陳大名', '風景', '拍日出夕陽和風景最怕反差太大，往往不是天空死白就是地面死黑，使用搖黑卡或縫卡技巧，當下就能改善過曝或過暗情形使作品恢復細節～拍日出或者拍夕陽更是要學。想體驗如此奧妙的感覺嗎？快來報名吧！', 15, 4000, '每周一', '09:00:00', '10:00:00', 5, '鼻頭角', '腳架,單眼相機', '2021-01-16', '2021-01-20', '2021-02-27', '2020-12-06 00:00:00', '2020-12-17 00:00:00', 1),
(39, '商品攝影實戰班2', '克萊德', '物品', '本課程為商業攝影實務，介紹三種主要造型之商品(圓柱或立方體、透明體、扁型商品)架棚方式與打光方式，只要您學起來，起碼能夠應付約70%的商品單品拍攝與簡單情境。', 15, 3500, '每周二', '19:00:00', '21:00:00', 4, '拍廊', '單眼相機', '2021-01-17', '2021-01-20', '2021-02-20', '2020-12-09 00:00:00', '2020-12-25 00:00:00', 1),
(40, '職人商品攝影必學課2', '楊紹凡', '物品', '本課程將不同種類的商品分為 10 個單元，在實作前，讓大家了解拍攝前應該如何構思畫面，拍攝的重點是什麼，先抓住拍攝重點，以便在後續實作過程中，明白操作的原因，幫助大家更快理解並記住各種拍攝技巧', 20, 3500, '每周二', '15:00:00', '16:00:00', 6, '華山藝文特區教室C', '類單眼相機', '2021-01-25', '2021-01-28', '2021-03-14', '2020-12-23 00:00:00', '2020-12-28 00:00:00', 1),
(41, '進階商業人像攝影課程', '楊紹凡', '人像', '進階攝影課程從實務操作學習商業人像攝影。', 16, 3880, '每周五', '04:00:00', '05:00:00', 3, '三創生活園區(5樓)', '單眼相機', '2021-01-02', '2021-01-08', '2021-01-22', '2020-10-15 00:00:00', '2020-12-04 00:00:00', 1),
(42, '進階商業商品攝影課程', '楊紹凡', '商品', '進階攝影課程從實務操作學習商業商品攝影。', 16, 4500, '每周四', '17:00:00', '18:00:00', 4, '三創生活園區(5樓)', '單眼相機', '2020-10-08', '2020-10-15', '2020-11-05', '2020-10-08 00:00:00', '2020-10-16 00:00:00', 1),
(43, '手機輕旅行的影片日記網美vlog班', '王子瑋', 'vlog', '這堂課將用系統且完整的方式，深入淺出地分享旅行錄影的技巧，只要善用自己的手機，就能用影片記錄下自己的旅行日記。', 8, 3500, '每周三', '06:00:00', '07:00:00', 5, '中原大學', '手機', '2020-11-23', '2020-12-02', '2020-12-16', '2020-10-14 00:00:00', '2020-11-17 00:00:00', 1),
(44, '手機美食攝影入門班', '王子瑋', '食物', '你喜愛和別人分享自己烹飪的美味料理嗎', 8, 1200, '每周三', '19:00:00', '20:00:00', 3, '華山藝文特區教室C', '手機', '2020-10-07', '2020-10-14', '2020-10-28', '2020-09-10 00:00:00', '2020-09-16 00:00:00', 1),
(45, '單眼相機攝影基礎新手入門班', '吳鑫', '人像', '學好攝影，人生變得更多彩多姿，想用相機記錄生命中美好的時刻嗎？如果你對攝影充滿興趣與熱忱，你也想拍出精彩好照片，卻不知道該如何著手？', 12, 3200, '每周四', '20:00:00', '21:00:00', 3, '中原大學', '單眼相機', '2021-02-11', '2021-02-25', '2021-03-12', '2021-01-30 00:00:00', '2021-02-06 00:00:00', 1),
(46, '單眼相機攝影進階班', '吳鑫', '人像', '學好攝影，人生變得更多彩多姿，想用相機記錄生命中美好的時刻嗎？如果你對攝影充滿興趣與熱忱，你也想拍出精彩好照片，卻不知道該如何著手？', 12, 3200, '每周五', '09:00:00', '10:00:00', 3, '中原大學', '單眼相機', '2021-04-15', '2021-04-16', '2021-04-30', '2021-03-05 00:00:00', '2021-04-03 00:00:00', 1),
(47, '單眼相機攝影專業班', '吳鑫', '人像', '學好攝影，人生變得更多彩多姿，想用相機記錄生命中美好的時刻嗎？如果你對攝影充滿興趣與熱忱，你也想拍出精彩好照片，卻不知道該如何著手？', 12, 3200, '每周六', '10:00:00', '11:00:00', 3, '中原大學', '單眼相機', '2020-05-30', '2020-06-05', '2020-06-19', '2020-04-10 00:00:00', '2020-05-15 00:00:00', 1),
(48, '高品質黑白暗房基礎班', '張金日', '底片沖洗', '透過反覆不斷沖洗照片，所作影像反差與影調層次控制的視覺美感判斷。', 4, 5000, '每周一', '11:00:00', '12:00:00', 5, '視丘攝影藝術學院', '底片相機', '2020-03-14', '2020-03-29', '2020-04-26', '2020-02-06 00:00:00', '2020-03-08 00:00:00', 1),
(49, '高品質黑白暗房進階班', '張金日', '底片沖洗', '透過反覆不斷沖洗照片，所作影像反差與影調層次控制的視覺美感判斷。', 4, 5000, '每周一', '12:00:00', '13:00:00', 5, '視丘攝影藝術學院', '底片相機', '2020-04-21', '2020-04-20', '2020-05-18', '2020-03-13 00:00:00', '2020-04-10 00:00:00', 1),
(50, '高品質黑白暗房高階班', '張金日', '底片沖洗', '透過反覆不斷沖洗照片，所作影像反差與影調層次控制的視覺美感判斷。', 4, 5000, '每周一', '13:00:00', '14:00:00', 5, '視丘攝影藝術學院', '底片相機', '2020-05-18', '2020-06-08', '2020-07-06', '2020-04-17 00:00:00', '2020-05-16 00:00:00', 1),
(51, '水中攝影班2', '林曼易', '風景', '水底攝影是最受歡迎的潛水專長之一，而數碼水底攝影的興起，讓水底攝影變得更簡單也更有趣。', 14, 3500, '每周二', '14:00:00', '15:00:00', 2, '小琉球', '單眼相機,底片相機', '2021-01-15', '2021-01-20', '2021-02-04', '2020-12-30 00:00:00', '2021-01-10 00:00:00', 1),
(52, '生態攝影班2', '林曼易', '風景', '生態攝影是只要一片青草綠地就能和你開啟的心靈對話，簡樸單純，從觀察而學習，看著小生命的不同脈動，你將會體驗更多的自然視界。', 16, 2500, '每周三', '15:00:00', '16:00:00', 4, '田寮月世界', '單眼相機,數位相機', '2021-01-20', '2021-01-25', '2021-02-25', '2020-12-25 00:00:00', '2021-01-16 00:00:00', 1),
(53, '印象派攝影班', '溫生蠔', '風景', '印象派最重要的風格，是「光」與「色彩」的關係。印象派具體研究光對色彩的影響，並具體表現?來', 3, 3000, '每周五', '16:00:00', '17:00:00', 4, '三創生活園區(5樓)', '單眼相機,底片相機', '2021-01-31', '2021-02-01', '2021-03-01', '2020-12-29 00:00:00', '2021-01-31 00:00:00', 1),
(54, '印象派攝影班2', '溫生蠔', '風景', '印象派最重要的風格，是「光」與「色彩」的關係。印象派具體研究光對色彩的影響，並具體表現?來', 1, 3000, '每周五', '17:00:00', '18:00:00', 3, '三創生活園區(5樓)', '單眼相機,底片相機', '2021-01-25', '2021-01-30', '2021-02-21', '2021-01-13 00:00:00', '2021-01-25 00:00:00', 1),
(55, '油土伯錄影課程', '楊紹凡', '影像編輯', '本課程ＣＰ值超高！不到兩個小時讓你完全搞懂數位錄影', 16, 2200, '每周五', '18:00:00', '19:00:00', 2, '華山藝文特區教室A', '相機', '2020-12-15', '2020-12-20', '2021-01-04', '2020-11-20 00:00:00', '2020-12-11 00:00:00', 1),
(56, '古典主義攝影班', '陳大名', '物品', '19世紀的歐洲，中產階級興起，藝術不再是王宮貴族的專利。19世紀早期的主流藝術是所謂的洛可可風格，繁複的裝飾，呈現華麗的特色。', 16, 2400, '每周四', '19:00:00', '20:00:00', 3, '華山藝文特區教室A', '數位相機,單眼相機', '2021-01-20', '2021-01-25', '2021-02-15', '2021-01-08 00:00:00', '2021-01-15 00:00:00', 1),
(57, '手機夜景拍攝班2', '吳佳穎', '風景', '「手機相機攝影」也是最近很多人想學的觀念，雖然攝影原理通了，任何攝影器材也能觸類旁通，本課程帶你以「手機相機」的角度，來練習如何操作手機正確的夜拍。', 25, 2500, '每周一', '20:00:00', '21:00:00', 4, '鰲峰山觀景平台', '手機', '2021-01-30', '2021-01-31', '2021-03-01', '2021-01-18 00:00:00', '2021-01-25 00:00:00', 1),
(58, '手機商品班2', '吳佳穎', '物品', '手機拍照已經是許多人生活中不可或缺的習慣，不論是把自己拍的美美或是出外旅行拍照打卡，手機拍照已經變成一種全民運動', 12, 3000, '每周一', '21:00:00', '22:00:00', 6, 'Anmagarden艾瑪花園', '手機', '2020-12-20', '2020-12-25', '2021-02-10', '2020-12-03 00:00:00', '2020-12-15 00:00:00', 1),
(59, '普普風人像班', '陳大名', '人像', '本課程包括2堂教室課，2堂外拍課，兼具觀念與技巧，理論與實務並用', 30, 3000, '每周日', '17:00:00', '18:00:00', 4, 'KEIZU Studio凱茲攝影部', '單眼相機,數位相機', '2021-02-20', '2021-02-25', '2021-03-25', '2020-02-09 00:00:00', '2021-02-20 00:00:00', 1),
(60, '現代風景攝影班2', '王曉明', '風景', '現代風景攝影在國外已經盛行多年，為國際風景攝影界主流，然而國內目前仍少有人知。', 16, 4000, '每周日', '18:00:00', '19:00:00', 2, '石岡落羽松', '單眼相機,底片相機', '2021-01-25', '2021-01-30', '2021-02-14', '2021-01-01 00:00:00', '2021-01-20 00:00:00', 1),
(61, '攝影全能專業人才班1', '黃仁益', '商業攝影', '課程中將藉由對解析現在商業攝影市場現況、學員作品交流討論，\n 加強攝影美感，進階訓練靜物、人物拍攝構圖與實拍經驗，\n 到商業攝影燈光基本原理之認識，\n 建立商業攝影中須具備的風格質感、商品與空間的表現手法，\n 讓有興趣商業攝影的學員快速掌握攝影工作實務與訣竅。', 10, 36000, '每周六日', '19:00:00', '20:00:00', 30, '學學4C', '單眼相機', '2020-11-01', '2020-11-14', '2021-02-21', '2020-09-17 00:00:00', '2020-09-20 00:00:00', 1),
(62, '攝影全能專業人才班2', '黃仁益', '商業攝影', '課程中將藉由對解析現在商業攝影市場現況、學員作品交流討論，\n 加強攝影美感，進階訓練靜物、人物拍攝構圖與實拍經驗，\n 到商業攝影燈光基本原理之認識，\n 建立商業攝影中須具備的風格質感、商品與空間的表現手法，\n 讓有興趣商業攝影的學員快速掌握攝影工作實務與訣竅。', 10, 36000, '每周六日', '18:00:00', '20:00:00', 30, '學學4C', '單眼相機', '2020-02-10', '2021-02-27', '2020-05-06', '2020-07-03 00:00:00', '2020-08-03 00:00:00', 1),
(63, '男朋友專屬-手機攝影課1', 'Handy老師', '手機、人像', '手機攝影力拯救計畫，就是現在。無論你們是情侶、夫妻或是死黨閨蜜，藉由手機基本拍照功能介紹、拍照前後的實際對比說明、現場六大基本功實際操作以及好用的修圖app介紹，你們將會互為彼此最佳的模特兒及專屬攝影師。快用手機攝影，影出你們之間每一刻的精彩及濃情演繹。', 6, 1000, '每周五 ', '21:00:00', '22:00:00', 1, '中國文化大學教育推廣部', '個人智慧型手機', '2020-12-25', '2021-01-08', '2021-01-08', '2020-06-14 00:00:00', '2020-06-14 00:00:00', 1),
(64, '男朋友專屬-手機攝影課2', 'Handy老師', '手機、人像', '手機攝影力拯救計畫，就是現在。無論你們是情侶、夫妻或是死黨閨蜜，藉由手機基本拍照功能介紹、拍照前後的實際對比說明、現場六大基本功實際操作以及好用的修圖app介紹，你們將會互為彼此最佳的模特兒及專屬攝影師。快用手機攝影，影出你們之間每一刻的精彩及濃情演繹。', 6, 1000, '每周五 ', '22:00:00', '23:00:00', 1, '中國文化大學教育推廣部', '個人智慧型手機', '2020-12-12', '2020-12-31', '2020-12-31', '2020-04-21 00:00:00', '2020-04-21 00:00:00', 1),
(65, '男朋友專屬-手機攝影課3', 'Handy老師', '手機、人像', '手機攝影力拯救計畫，就是現在。無論你們是情侶、夫妻或是死黨閨蜜，藉由手機基本拍照功能介紹、拍照前後的實際對比說明、現場六大基本功實際操作以及好用的修圖app介紹，你們將會互為彼此最佳的模特兒及專屬攝影師。快用手機攝影，影出你們之間每一刻的精彩及濃情演繹。', 6, 1000, '每周五 ', '23:00:00', '00:00:00', 1, '中國文化大學教育推廣部', '個人智慧型手機', '0000-00-00', '2020-12-11', '2020-12-11', '2020-07-06 00:00:00', '2020-07-26 00:00:00', 1),
(66, '拍出讓親朋好友們稱羨的美好日常1', '王竹君', '手機、人像、風景', '明明去一樣的地方，別人拍的就是比較好看？\n 想留下照片作紀念，但連手機的功能都不太清楚？\n 這堂課可以解決大人在手機攝影中常遇到的困難！\n 無論是照片構圖還是鏡頭對焦的運用，甚至是手機中的修片的功能。\n 所有問題都可以在這兩次的課程中獲得解答。', 10, 4800, '每周二 ', '00:00:00', '01:00:00', 2, '台灣文創訓練中心', '個人智慧型手機', '2020-11-26', '2020-12-01', '2021-03-12', '2020-05-07 00:00:00', '2020-05-07 00:00:00', 1),
(67, '拍出讓親朋好友們稱羨的美好日常2', '王竹君', '手機、人像、風景', '明明去一樣的地方，別人拍的就是比較好看？\n 想留下照片作紀念，但連手機的功能都不太清楚？\n 這堂課可以解決大人在手機攝影中常遇到的困難！\n 無論是照片構圖還是鏡頭對焦的運用，甚至是手機中的修片的功能。\n 所有問題都可以在這兩次的課程中獲得解答。', 10, 4800, '每周二 ', '01:00:00', '02:00:00', 2, '台灣文創訓練中心', '個人智慧型手機', '2020-11-12', '2020-11-17', '2020-11-25', '2020-11-04 00:00:00', '2020-11-04 00:00:00', 1),
(68, '讓拍照成為你的樂趣', '莊粵盛', '手機、風景', '這堂課專門為對風景拍攝、夜景拍攝有興趣的大人設計\n 讓資深攝影老師告訴你夜景要怎麼拍才會漂亮\n 你會更清楚知道如何拍出好看的旅遊風景照\n 再藉由兩次邊玩邊學的外拍教學課程，親自實作\n 前往特色地標─淡水老街與新北耶誕城\n 練習把學到的技巧應用出來，親身體驗拍照的樂趣', 10, 4000, '每周四 ', '14:00:00', '17:00:00', 2, '台灣文創訓練中心', '個人智慧型手機', '2020-11-14', '2020-11-19', '2020-12-03', '2020-04-27 00:00:00', '2020-04-30 00:00:00', 1),
(69, '拍出顯高顯瘦好照片1', '莊粵盛', '手機、人像', '這堂課專門為想要拍好人像攝影，對情境營造有興趣的大人設計\n 讓資深攝影老師告訴你人像拍攝要注意什麼重點\n 你會更清楚知道要怎樣引導人物拍照\n 再藉由兩次邊玩邊學的外拍教學課程，親自實作\n 前往特色地標─捷運中山站與圓山花博公園\n 練習把學到的技巧應用出來，親身體驗拍照的樂趣', 10, 4000, '每周四 ', '08:00:00', '09:00:00', 2, '台灣文創訓練中心', '個人智慧型手機', '2020-11-28', '2020-12-03', '2020-12-17', '2020-03-26 00:00:00', '2020-03-27 00:00:00', 1),
(70, '風景攝影必學 9 堂課 – 入門', '賀禎禎', '風景', '攝影入門班共 5 堂課，從「相機、鏡頭硬體認識」開始，接著我們認識一張照片「如何曝光」，認識風景攝影最重要的「景深認識與應用」，最後學習如何彈性調整「曝光補償」以拍出精采的作品。', 10, 3600, '每周二 ', '09:00:00', '10:00:00', 9, '影空間', '單眼相機', '2020-11-15', '2020-12-08', '2021-01-26', '2020-09-23 00:00:00', '2020-09-23 00:00:00', 1),
(71, '風景攝影必學 9 堂課 – 進階', '賀禎禎', '風景', '攝影進階班則是延續課程，先來認識一般初學者最不容易搞懂的「超焦距攝影觀念」，以拍出「全景深」的作品，接著我們回到「攝影的原點」，二堂課學習攝影最重要的學習架構，而最後一堂課則是「專題討論」，研究最常見的風景攝影主題，逐步拆解每個動作背後的原理。', 10, 3900, '每周二 ', '19:30:00', '21:00:00', 9, '影空間', '單眼相機', '2020-01-15', '2021-02-16', '2021-04-13', '2020-11-05 00:00:00', '2020-11-05 00:00:00', 1),
(72, '風景攝影必學 9 堂課 – 入門+進階', '賀禎禎', '風景', '9 堂針對風景攝影所設計的課程，前 5 堂課基礎認識，包含相機、鏡頭介紹，基本曝光概念、景深原理以及「曝光控制」，後 4 堂則是進階課，從「攝影原點」出發，教你拍出「全景深」作品，最後精心挑選數個最常見的風景攝影實例，一步步解析創作原理與過程。', 10, 6300, '每周二 ', '21:30:00', '22:00:00', 18, '影空間', '單眼相機', '2020-11-15', '2020-12-08', '2021-04-13', '2020-05-06 00:00:00', '2020-05-06 00:00:00', 1),
(73, '十面講堂攝影實戰、編修班', '十面埋伏蔡老師', '風景', '1.一堂1室內課講技巧、兩堂外拍實戰、一堂3實戰結果編修技巧\n 2.連續循環方式1、2、3讓學員完全吸收、靈活運用\n 3.群組每周傳外拍講解影片、修圖技巧影片讓缺課學員線上學習\n 4.除固定外拍每周還有不定期外拍場次供學員選擇\n 5.實戰技巧超豐富十面老師指導外，更有實力堅強助教輔導', 16, 3200, '每周三', '12:00:00', '13:00:00', 1, '台中文創館1301教室', '單眼相機', '2020-12-02', '2020-12-17', '2020-12-17', '2020-08-23 00:00:00', '2020-09-13 00:00:00', 1),
(74, '花見小路-手機攝影旅遊實拍實戰課程1', '王小路', '風景', '手機攝影已經是大眾的全民運動，不管是美美的自拍，還是旅遊踏青的風景，再也不需要專業的相機，手機就拍出媲美單眼相機的效果。很榮幸邀請到手機攝影界達人中的達人，花見小路手機攝影王小路 老師，將教領學員們手機攝影的色彩運用、構圖、光影層次及視覺美學，還有多款不限手機型號都能入門的app實用技巧。不管是零經驗的初學者，還是想多認識修圖技巧的學員們，只要跟隨老師的教學指導，不用再眼巴巴羨慕別人的照片，自己也能輕鬆拍出人氣破百讚的吸睛好照片！', 6, 3200, '每周四', '09:00:00', '18:00:00', 1, '暖時光咖啡 Warm Up Coffee', '個人智慧型手機', '2020-12-26', '2021-01-03', '2021-01-03', '2020-10-01 00:00:00', '2020-10-02 00:00:00', 1),
(75, '花見小路-手機攝影旅遊實拍實戰課程2', '王小路', '風景', '手機攝影已經是大眾的全民運動，不管是美美的自拍，還是旅遊踏青的風景，再也不需要專業的相機，手機就拍出媲美單眼相機的效果。很榮幸邀請到手機攝影界達人中的達人，花見小路手機攝影王小路 老師，將教領學員們手機攝影的色彩運用、構圖、光影層次及視覺美學，還有多款不限手機型號都能入門的app實用技巧。不管是零經驗的初學者，還是想多認識修圖技巧的學員們，只要跟隨老師的教學指導，不用再眼巴巴羨慕別人的照片，自己也能輕鬆拍出人氣破百讚的吸睛好照片！', 6, 3200, '每周四', '09:00:00', '18:00:00', 1, '暖時光咖啡 Warm Up Coffee', '個人智慧型手機', '2021-01-02', '2021-01-17', '2021-01-17', '2020-07-12 00:00:00', '2020-07-12 00:00:00', 1),
(76, '你最需要的 4 小時攝影入門菁華課', '賀禎禎', '風景', '這一堂課，不只是教你「攝影基本元素認識」，而是一堂足以建構攝影最剛、實的架構，讓你面對各種主題應用，都能帶著這架構，迎刃而解，同時在任何場合下自由應用，這就是本堂課要教你的概念，同時也是我從事攝影教學、寫作數年下最珍貴的經驗。', 16, 1890, '每周五', '09:00:00', '18:00:00', 1, '晴光 嚴選攝影器材', '', '2021-03-05', '2021-03-12', '2021-03-12', '2020-10-14 00:00:00', '2020-10-14 00:00:00', 1),
(77, '觸動人心 高雄攝影基礎班1', '邱泓璋', '人像,風景', '您是否常感覺相機不差，卻難以帶回眼前的感動？本課程由資深攝影講師邱泓璋親授攝影基礎及各種構圖心法，透過循序漸進的專業課程，讓您輕鬆掌握用相片觸動人心的秘訣，來這裡學一點發現美的本事，用鏡頭練練眼光，你也能拍出心動的相片！舒適的上課環境，便利的交通位置及停車空間，錯過本期請再細數夕陽60次。', 25, 3, '每周三', '19:00:00', '21:00:00', 11, '高雄市大東藝術中心 1F藝文教室A', '單眼相機,微單眼相機,類單眼相機', '2020-11-15', '2020-11-25', '2021-01-13', '2020-08-29 00:00:00', '2020-08-31 00:00:00', 1),
(78, '觸動人心 高雄攝影基礎班2', '邱泓璋', '人像,風景', '您是否常感覺相機不差，卻難以帶回眼前的感動？本課程由資深攝影講師邱泓璋親授攝影基礎及各種構圖心法，透過循序漸進的專業課程，讓您輕鬆掌握用相片觸動人心的秘訣，來這裡學一點發現美的本事，用鏡頭練練眼光，你也能拍出心動的相片！舒適的上課環境，便利的交通位置及停車空間，錯過本期請再細數夕陽60次。', 25, 3, '每周三', '17:00:00', '18:00:00', 11, '高雄市大東藝術中心 1F藝文教室A', '單眼相機,微單眼相機,類單眼相機', '2021-01-14', '2021-01-27', '2021-03-10', '2020-08-16 00:00:00', '2020-08-18 00:00:00', 1),
(79, '觸動人心 高雄攝影基礎班3', '邱泓璋', '人像,風景', '您是否常感覺相機不差，卻難以帶回眼前的感動？本課程由資深攝影講師邱泓璋親授攝影基礎及各種構圖心法，透過循序漸進的專業課程，讓您輕鬆掌握用相片觸動人心的秘訣，來這裡學一點發現美的本事，用鏡頭練練眼光，你也能拍出心動的相片！舒適的上課環境，便利的交通位置及停車空間，錯過本期請再細數夕陽60次。', 25, 3, '每周三', '18:00:00', '19:00:00', 11, '高雄市大東藝術中心 1F藝文教室A', '單眼相機,微單眼相機,類單眼相機', '2021-03-25', '2021-04-07', '2021-05-02', '2020-10-08 00:00:00', '2020-10-08 00:00:00', 1),
(80, '觸動人心 高雄攝影基礎班4', '邱泓璋', '人像,風景', '您是否常感覺相機不差，卻難以帶回眼前的感動？本課程由資深攝影講師邱泓璋親授攝影基礎及各種構圖心法，透過循序漸進的專業課程，讓您輕鬆掌握用相片觸動人心的秘訣，來這裡學一點發現美的本事，用鏡頭練練眼光，你也能拍出心動的相片！舒適的上課環境，便利的交通位置及停車空間，錯過本期請再細數夕陽60次。', 25, 3, '每周三', '19:00:00', '20:00:00', 11, '高雄市大東藝術中心 1F藝文教室A', '單眼相機,微單眼相機,類單眼相機', '2021-05-07', '2021-05-19', '2021-07-07', '2020-10-17 00:00:00', '2020-10-17 00:00:00', 1),
(81, '文青風格攝影班1', '趙佩珊', '居家', '室內拍攝教你如何文青', 15, 2000, '每周一', '09:00:00', '12:00:00', 2, '袖珍博物館', '單眼相機', '2020-10-20', '2020-11-02', '2020-11-09', '2020-10-05 00:00:00', '2020-10-05 00:00:00', 1),
(82, '文青風格攝影班2', '趙佩珊', '居家', '室內拍攝教你如何文青', 15, 2000, '每周二', '09:00:00', '12:00:00', 2, '袖珍博物館', '單眼相機', '2020-10-21', '2020-11-03', '2020-11-10', '2020-10-05 00:00:00', '2020-10-08 00:00:00', 1),
(83, '文青風格攝影班3', '趙佩珊', '居家', '室內拍攝教你如何文青', 15, 2000, '每周三', '09:00:00', '12:00:00', 2, '袖珍博物館', '單眼相機', '2020-10-22', '2020-11-04', '2020-11-11', '2020-10-05 00:00:00', '2020-10-07 00:00:00', 1),
(84, '文青風格攝影班4', '趙佩珊', '居家', '室內拍攝教你如何文青', 15, 2000, '每周四', '09:00:00', '12:00:00', 2, '袖珍博物館', '單眼相機', '2020-10-23', '2020-11-05', '2020-11-12', '2020-10-05 00:00:00', '2020-10-09 00:00:00', 1),
(85, '文青風格攝影班5', '趙佩珊', '居家', '室內拍攝教你如何文青', 15, 2000, '每周五', '09:00:00', '12:00:00', 2, '袖珍博物館', '單眼相機', '2020-10-24', '2020-11-06', '2020-11-13', '2020-10-05 00:00:00', '2020-10-05 00:00:00', 1),
(86, '手機拍也能是藝術班1', '徐一', '都市', '輕鬆教學', 10, 4000, '每周四', '09:00:00', '12:00:00', 3, '松菸', '個人智慧型手機', '2020-10-30', '2020-11-05', '2020-11-19', '2020-10-20 00:00:00', '2020-10-25 00:00:00', 1),
(87, '手機拍也能是藝術班2', '徐一', '都市', '輕鬆教學', 10, 4000, '每周三', '09:00:00', '12:00:00', 3, '松菸', '個人智慧型手機', '2020-10-30', '2020-11-04', '2020-11-18', '2020-10-20 00:00:00', '2020-10-24 00:00:00', 1),
(88, '朦朧美初級攝影班', '何孟涵', '雨天', '神秘意境中浮想聯翩，獲得觀賞的美感', 18, 1500, '每周三', '09:00:00', '18:00:00', 1, '水漾森林', '單眼相機,底片相機', '2020-10-30', '2020-11-25', '2020-11-25', '2020-10-21 00:00:00', '2020-10-22 00:00:00', 1),
(89, '朦朧美手機攝影班', '何孟涵', '雨天', '神秘意境中浮想聯翩，獲得觀賞的美感', 10, 1500, '每周四', '09:00:00', '18:00:00', 1, '水漾森林', '手機', '2020-10-30', '2020-11-26', '2020-11-26', '2020-10-22 00:00:00', '2020-10-22 00:00:00', 1),
(90, '朦朧美單眼相機攝影班', '何孟涵', '雨天', '神秘意境中浮想聯翩，獲得觀賞的美感', 12, 1500, '每周五', '09:00:00', '18:00:00', 1, '水漾森林', '單眼相機', '2020-10-30', '2020-11-27', '2020-11-27', '2020-10-23 00:00:00', '2020-10-30 00:00:00', 1),
(91, '專業攝影班1', '洪佩芸', '風景', '彰顯出一個拍攝物所有的壯麗輝煌', 15, 2500, '每周三', '09:00:00', '12:00:00', 2, '花東縱谷', '單眼相機', '2020-10-30', '2020-11-04', '2020-11-11', '2020-10-16 00:00:00', '2020-10-22 00:00:00', 1),
(92, '猴子也會拍攝影班', '盧惠雯', '室內', '初階攝影課程', 15, 2000, '每周三', '07:00:00', '08:00:00', 2, '林口東勢閱覽室', '手機', '2020-10-25', '2020-12-09', '2020-12-16', '2020-10-05 00:00:00', '2020-10-08 00:00:00', 1),
(93, '猴子也會拍攝影班', '盧惠雯', '室內', '初階攝影課程', 25, 2000, '每周四', '08:00:00', '11:00:00', 2, '林口東勢閱覽室', '手機', '2020-10-25', '2020-12-10', '2020-12-17', '2020-10-05 00:00:00', '2020-10-15 00:00:00', 1),
(94, '大師級攝影班', '王萱', '風景', '專業攝影', 5, 2000, '每周三', '09:00:00', '12:00:00', 1, '栗松溫泉', '單眼相機', '2020-10-26', '2020-10-28', '2020-10-28', '2020-10-08 00:00:00', '2020-10-08 00:00:00', 1),
(95, '大師級攝影班', '王萱', '風景', '專業攝影', 5, 2000, '每周四', '10:00:00', '13:00:00', 1, '栗松溫泉', '單眼相機', '2020-10-26', '2020-10-29', '2020-10-29', '2020-10-08 00:00:00', '2020-10-14 00:00:00', 1),
(96, '專業攝影班2', '張莉郁', '風景', '專業攝影', 8, 1500, '每周四', '11:00:00', '14:00:00', 1, '水湳洞十三層遺址', '單眼相機', '2020-10-29', '2020-12-03', '2020-12-03', '2020-10-15 00:00:00', '2020-10-28 00:00:00', 1),
(97, '專業攝影班', '張莉郁', '風景', '專業攝影', 8, 1500, '每周五', '12:00:00', '15:00:00', 1, '水湳洞十三層遺址', '單眼相機', '2020-10-29', '2020-12-04', '2020-12-04', '2020-10-15 00:00:00', '2020-10-29 00:00:00', 1),
(98, '寫實攝影班3', '許玉婷', '風景', '專業的攝影將之拍攝成美麗又有質感的照片', 10, 3000, '每周三', '13:00:00', '16:00:00', 2, '火炎山', '單眼相機', '2020-10-30', '2020-11-18', '2020-11-25', '2020-10-01 00:00:00', '2020-10-27 00:00:00', 1),
(99, '寫實攝影班2', '許玉婷', '風景', '專業的攝影將之拍攝成美麗又有質感的照片', 12, 3000, '每周二', '14:00:00', '17:00:00', 2, '火炎山', '單眼相機', '2020-10-30', '2020-11-17', '2020-11-24', '2020-10-01 00:00:00', '2020-10-24 00:00:00', 1),
(100, '寫實攝影班1', '許玉婷', '風景', '專業的攝影將之拍攝成美麗又有質感的照片', 11, 3000, '每周一', '15:00:00', '18:00:00', 2, '火炎山', '單眼相機', '2020-10-30', '2020-11-16', '2020-11-23', '2020-10-01 00:00:00', '2020-10-15 00:00:00', 1);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `class`
--
ALTER TABLE `class`
  ADD PRIMARY KEY (`class_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `class`
--
ALTER TABLE `class`
  MODIFY `class_id` int(50) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
